; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image4 - mode
	infrared2 - mode
	infrared1 - mode
	thermograph3 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph3)
	(supports instrument0 infrared1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
)
(:goal (and
	(have_image Star6 image4)
	(have_image Phenomenon7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Phenomenon9 image4)
	(have_image Star10 thermograph3)
	(have_image Star11 infrared0)
	(have_image Star12 image4)
))

)

; plan
1. (turn_to satellite0 groundstation4 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 star10 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star10)
   goals met: 0 of 7
5. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 1 of 7
6. (turn_to satellite0 planet8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet8)
   goals met: 1 of 7
7. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon9 instrument0 image4)
   added: (have_image phenomenon9 image4)
   goals met: 3 of 7
10. (turn_to satellite0 phenomenon7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 7
11. (take_image satellite0 phenomenon7 instrument0 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 4 of 7
12. (turn_to satellite0 star11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star11)
   goals met: 4 of 7
13. (take_image satellite0 star11 instrument0 infrared0)
   added: (have_image star11 infrared0)
   goals met: 5 of 7
14. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 5 of 7
15. (take_image satellite0 star12 instrument0 image4)
   added: (have_image star12 image4)
   goals met: 6 of 7
16. (turn_to satellite0 star6 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star6)
   goals met: 6 of 7
17. (take_image satellite0 star6 instrument0 image4)
   added: (have_image star6 image4)
   goals met: 7 of 7
